#+TITLE: My Doom Configuration

** Modeline height
#+BEGIN_SRC emacs-lisp
(setq doom-modeline-height 16)
#+END_SRC

#+RESULTS:
: 18

** Tag position
#+BEGIN_SRC emacs-lisp
(setq org-tags-column -80)
#+END_SRC

#+RESULTS:
: -80

** Configuration
To first start using Org-roam, one needs to pick a location to store the
Org-roam files. The directory that will contain your notes, and database index
is specified by the variable =org-roam-directory=.

#+BEGIN_SRC emacs-lisp
(unless (file-exists-p "~/org-roam") (make-directory "~/org-roam"))
(setq org-roam-directory "~/org-roam")
(setq org-roam-graphviz-executable (executable-find "neato"))
(setq org-roam-graphviz-extra-options '(("overlap" . "false")))
#+END_SRC

#+RESULTS:
: ((overlap . false))

Enable the global minor mode org-roam-mode
#+BEGIN_SRC emacs-lisp
(add-hook 'after-init-hook 'org-roam-mode)
#+END_SRC
** Ox-Hugo export
I use ox-hugo to export my org-roam notes to markdown and then to web pages. The
my/org-export-all-roam loops through all the org files and exports them one by
one.

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'ox-hugo
  (defun my/org-export-all-roam ()
    (interactive)
    (mapc (lambda (fPath)
            (ignore-errors (with-temp-buffer
                             (find-file-read-only fPath)
                             (org-hugo-export-to-md)
                             (kill-buffer))))
          (org-roam--list-files org-roam-directory)))
  (citeproc-org-setup))
;; Using Deft in org-mode
(setq deft-directory "~/org-roam/")
#+END_SRC

#+RESULTS:
: ~/org-roam/

** Capture Templates
#+BEGIN_SRC emacs-lisp
(defun my/generate-org-note-name (&optional dir)
  (setq org-note--name (read-string "Name: "))
  (setq org-note--time (format-time-string "%Y%m%d"))
  (setq dirname (format "~/org/%s" dir))
  (message dirname)
  (expand-file-name (format "%s-%s.org" org-note--time org-note--name) dirname))
(defun my/create-meeting-note ()
  (my/generate-org-note-name "meeting"))
(defun my/create-interview-note ()
  (my/generate-org-note-name "interview"))

(setq org-capture-templates
      '(
        ("t" "Task"  entry
         (file "~/org/tasks/tasks.org")
         "* TODO %?\n%U")
        ("p" "Personal Task"  entry
         (file "~/org/tasks/personal.org")
         "* TODO %?\n%U")
        ("m" "Meeting Notes" entry
         (file my/create-meeting-note)
         (file "~/Dotfiles/emacs/templates/meeting.template"))
        ("i" "Interview Notes" entry
         (file my/create-interview-note)
         (file "~/Dotfiles/emacs/templates/interview.template"))
        )
      )
#+END_SRC

#+RESULTS:
| t | Task | entry | (file ~/org/tasks/tasks.org) | * TODO %? |

** Some useful Keybindings
#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "C-c c") 'org-capture)
(define-key global-map (kbd "C-c t")
  (lambda () (interactive) (org-capture nil "t")))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (org-capture nil t) |
** Org-super-agenda
#+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
      '(("z" "My view"
         ((agenda "" ((org-agenda-span 'day)
                      (org-super-agenda-groups
                       '((:name "Today"
                                :time-grid t
                                :date today
                                :scheduled today
                                :order 1)))))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        '(;; Each group has an implicit boolean OR operator between its selectors.
                          (:name "Due Today"
                                 :deadline today)
                          (:name "Passed Deadline"
                                 :and (:deadline past :todo ("TODO" "WAITING" "HOLD" "IN-PROGRESS"))
                                 :face (:background "#ffe2de"))
                          (:name "Work important"
                                 :and (:priority>= "B" :category "Work" :todo ("TODO" "IN-PROGRESS")))
                          (:name "Personal"
                                 :and (:category "personal" :todo ("TODO" "IN-PROGRESS")))
                          (:name "Bills"
                                 :and (:category "finance" :todo ("TODO" "IN-PROGRESS")))
                          (:name "Important"
                                 :priority "A")
                          (:name "Blocked"
                                 :todo "BLOCKED"
                                 :order 10)))))))))
(add-hook 'org-agenda-mode-hook 'org-super-agenda-mode)
#+END_SRC

#+RESULTS:
| org-super-agenda-mode | +org-habit-resize-graph-h | evil-org-agenda-mode |

